paulfantom/BLDC-ESC/inspiration/c8051f330/f330_100a_bl_esc_step_5p.c
//-----------------------------------------------------------------------------
// F330_100A_BL_ESC_STEP_5P.c "BEMF + Zero cross control" with Pull-up while PWM off
//-----------------------------------------------------------------------------
// Copyright (C) 2007 Takao
//
// AUTH: Takao
// DATE: Jan 26th, 2007
//
// Target:         C8051F330
// Tool chain:     Keil C51 7.50 / Keil EVAL C51
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <c8051f330.h>
// The differences between F41x are
// PCA0CPH5 -> PCA0CPH2 (Watch dog timer)
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 16-bit SFR Definitions for C8051Fxxx
//-----------------------------------------------------------------------------
sfr16 TMR2RL	= 0xca; // TMR2RLL = 0xca, TMR2RLH = 0xcb. Timer2 reload register
sfr16 TMR2		= 0xcc; // TMR2L = 0xcc, TMR2H = 0xcd. Timer2 counter
sfr16 TMR3RL	= 0x92; // TMR3RLL = 0x92, TMR3RLH = 0x93. Timer3 reload register
sfr16 TMR3		= 0x94;	// TMR3L = 0x94, TMR3H = 0x95. Timer3 counter
//-----------------------------------------------------------------------------
// Global CONSTANTS
//-----------------------------------------------------------------------------
// Starting parameters
#define STEPPING_ON_DUTY_CHOPPING_COUNT 30 //Init Stepping starting current limit chopping count
#define STEPPING_MAX_SPEED_CHOPPING_COUNT 3
#define START_STEPPING_DUTY_FRAME 1500	//*24.5/12MHz clock=490nS  Start duty checking Duty frame
#define STEPPING_ON_DUTY_RATIO 30	// x:1. STEPPING_ON_DUTY = START_STEPPING_DUTY_FRAME/STEPPING_ON_DUTY_RATIO
									// Init Current limit setting in start step drive as on-duty setting 
// Propo-input data parameters 
#define CTRL_MIN 2040 	//1mS. MIN_OFFSET/0.49(=12/SYSCLK); number of timer counts PCA 1/12 sys.clk in 
						//capture range sample(0800h - 1065h)
#define THROTTLE_OFF 8	// CONTROL_DATA

//BEMF+ ZC spin parameters
#define BEMF_DUTY_INC_TIMING 50	// BEMF power step up increasing timing frame on Timer 2
#define PWM_FRAME_1kHz 2040	// 1kHz sampling at starting
#define PWM_FRAME_2kHz 1020	// 2kHz sampling at starting
#define PWM_FRAME_3kHz 680	// 3kHz sampling at starting
#define PWM_FRAME_5kHz 408	// 5kHz sampling at starting
#define PWM_FRAME_8kHz 255	// 8kHz sampling at starting
#define PWM_FRAME_13kHz 157	// 13kHz sampling at starting
#define PWM_FRAME_20kHz 102	// 20kHz sampling at starting

#define REAR_EDGE_TO_ZC_POINT 6
		//; This value concerns with zero cross max speed stability.  
		//; Safty Margin of POWER on Time of the rear edge od inductive kick to zero cross point.
		//; May be "7" is for low voltage CD-ROM motor drive, may be "2" is good for high speed spin as ducted fan.
		//; This value is (T2) Sync out as "COULD_NOT_CATCH_CROSS_POINT" in zero cross mode.
		//; The time should be less than 500uS to get until zero coross point after inductive kick rear edge.

#define IND_KICK_TIME_CHECK 3	// 490nS x 255 x this value
		// The inductive kick time is checked by T2 high. and if the time is over this value.
		// It means could not catch the indutive kick as sync. out.  	

#define STICK_RESOLUTION 100
		// PWM resolution vs stick control range 

#define CHECK_ZC_AT_PWM_ON_DUTY STICK_RESOLUTION*95/100
		// Change to zero cross sensing point to the end of ON duty.
		// At slow rpm, The ZC sampling point is the end of OFF duty.
//-----------------------------------------------------------------------------
// Function PROTOTYPES
//-----------------------------------------------------------------------------
void Step_Drive_Count (void);
void Step_Start (void);
void Stepping_Drive_On_Timer (void);
void Stepping_Off_Timer (void);

void Wait_1250nS (COUNTS);	//1.25uS at (0) timer
void ON_Sound (void);	// 
void Spin_Free (void);	// 	
void State1_On (void);	// 
void State2_On (void);	// 
void State3_On (void);	// 
void State4_On (void);	// 
void State5_On (void);	// 
void State6_On (void);	// 
void Braking (void);	//
void Spin_Free_N (void);

void PCA_ISR (void);	// PCA Interrupt Service Routine for Rx in
void T1_ISR (void);

void BEMF_Drive (void);
void Power_Up_Timer (void);
void T1_PWM_OFF_DUTY (void);
void T1_PWM_ON_DUTY (void);
void Get_Comp_Data (void);	//
void Comp_Measure (void);	//
void Check_Free_Spinning (void);
void Start_T0 (void);

void Set_comparator_input_for_ZC_detect (void);
void Zero_Cross_Drive (void);
void Set_to_next_drive (void);
//-----------------------------------------------------------------------------
// Global VARIABLES
//-----------------------------------------------------------------------------
unsigned char L1;	// Used in ON_Sound (),
unsigned char L2;	// Used in ON_Sound (), Step_Drive_Count (), Get_Comp_Data ()
unsigned int TEMP0;	// Used in ON_Sound (), Stepping_Drive_On_Timer (), Comp_Measure ()
unsigned int TEMP1;	// Used in ON_Sound (), 
unsigned char TEMP2;	// Used in ON_Sound (), Stepping_Drive_On_Timer ()
unsigned char TEMP3;	// Used in Check_Free_Spinning ()
unsigned int TEMP16;	// Used in Stepping_Drive_On_Timer (), T1_PWM_ON_DUTY (), T1_PWM_OFF_DUTY (
unsigned int TEMP16S;

unsigned int COUNTS; //
unsigned int DELAY_COUNTS;
unsigned char START_DRIVE_STATE;
unsigned int  STEPPING_ON_DUTY;

unsigned char PCA0_CAP_L;
unsigned char PCA0_CAP_H;
unsigned int PCA0_CAP;
signed int PULSE_WIDTH;
unsigned char CONTROL_DATA_0;
unsigned char CONTROL_DATA;
unsigned char CONTROL_DATA_MAX;
unsigned char PROPO_PULSE_IN_COUNTER;

unsigned char ON_DUTY;
unsigned int PWM_FRAME;
unsigned char DRIVE_STATE;
unsigned char PREV_DRIVE_STATE;

unsigned char NUMBER_OF_SAMPLING;
unsigned int PHASE_AVERAGE_T;
unsigned char SAMPLING_COUNT;

unsigned int ZC_OFF_DUTY;

bit LOST_ZC;	// could not catch the zero cross point by may be too much rpm
bit SPINNING;
bit T1_Op_Flag;
bit ZERO_CROSS_RUN;
bit OVER_ZERO_CROSS;
bit STATE_CHANGES; 
//-----------------------------------------------------------------------------
// main() Routine
//-----------------------------------------------------------------------------
void main (void) 
{
	PCA0MD &= ~0x40;		// WDTE = 0 disable watchdog timer

// Initialize crossbar and GPIO
    // P0.0  -  Skipped,     Open-Drain, Analog
    // P0.1  -  Skipped,     Open-Drain, Analog
    // P0.2  -  Skipped,     Open-Drain, Analog
    // P0.3  -  Skipped,     Open-Drain, Analog
    // P0.4  -  Skipped,     Open-Drain, Analog
    // P0.5  -  Skipped,     Open-Drain, Analog
    // P0.6  -  Skipped,     Push-Pull,  Digital
    // P0.7  -  CEX0 (PCA),  Open-Drain, Digital

