paulfantom/BLDC-ESC/inspiration/c8051f330/f330_100a_bl_esc_step_5p.c
    // P1.0  -  Skipped,     Push-Pull,  Digital
    // P1.1  -  Skipped,     Open-Drain, Analog
    // P1.2  -  Skipped,     Open-Drain, Analog
    // P1.3  -  Skipped,     Open-Drain, Analog
    // P1.4  -  Unassigned,  Push-Pull,  Digital
    // P1.5  -  Unassigned,  Push-Pull,  Digital
    // P1.6  -  Unassigned,  Push-Pull,  Digital
    // P1.7  -  Unassigned,  Push-Pull,  Digital

    P0MDIN    = 0xC0;
    P1MDIN    = 0xF1;
    P0MDOUT   = 0x40;
    P1MDOUT   = 0xF1;
    P2MDOUT   = 0x01;
    P0SKIP    = 0x7F;
    P1SKIP    = 0x0F;
    XBR1      = 0x41;

	OSCICN = 0x83;			// Configure 24.5MHz internal oscillator

// PCA0_INT:	; Programable Counter Array is used in Edge-triggered Caputure Mode for power control input from Rx.
	PCA0MD = 0;			//#00000000b	; PCA0 works in 1/12 system clock
	PCA0CN |= 0x40;		//#01000000b	; Run Programmable Counter 0 
	PCA0CN &= 0xfc;		//#11111100b	; Clear PCA Module 0 and 1 Capture/Compare Flag for acceleration meter
	PCA0CPM0 |=0x21;	//#00100001b	; PCA0 is captured by positive edge first on P0.7, Also generates the interrupt.
	EIE1 |= 0x10;		//#00010000b	; enable PCA0 interrupts 
   	CCF0 = 0;			//             	; clear PCA0 module0 interrupt flag
//	EIP1 |= 0x10;		//#00010000b	; PCA0 innterrupt set to high priority level.
	PCA0CPM1 |= 0x48;	//#01001000b	; PCA Module 1 Capture/Compare Flag enable for acceleration meter offset adj. timing
//
	TMOD = 0x11;		// #00010001b	; Set Timer0,1 16 bit counter mode
//

	PCA0CPL2 = 32;		// The watch dog timing is 4mS interval
	PCA0MD |= 0xc0; 	//	#11000000b	; PCA suspend while CPU is supended and WDT is "ON".
//
//	Wake_Up_comparator:
	CPT0CN |= 0x80;		//	#10000000b	; bit7: Comp. Enable, bit6: Comp out, bit5,4: no interrupt, bit3-0: no hys.
	CPT0MD = 0;			// 100nS responce
//
//PWR ON_Sound:
	TEMP0 = 40;			// 10% On duty
	TEMP1 = 360;		// Off duty
	TEMP2 = 45;			// frame counts 
	ON_Sound();
//
	CONTROL_DATA = 0;
	CONTROL_DATA_MAX = 255; 
	PROPO_PULSE_IN_COUNTER = 0;	// Propo signal-in counter to make sure the initial control data
	EA = 1;            // Enable global interrupts
//
	while ( PROPO_PULSE_IN_COUNTER < 10 )	// make sure the stick off position
		{
		PCA0CPH2 = 0;	// Watch dog timer off. 
		}

//Propo Signal-in Sound:
	TEMP0 = 20;			// 20% On duty
	TEMP1 = 80;			// Off duty
	TEMP2 = 90;			// frame counts 
	EA = 0;				// Disable global interrupts for clear sound
	ON_Sound();
	EA = 1;				// Enable global interrupts		
//
	CKCON &= 0xbf; 		//anl CKCON, #10111111b	; Timer0,1,3 works with 1/12 system clock
	P2 = 0; // Monitor ONLY
//;--------------
STEPPING_START:
//;--------------
	PCA0CPL2 = 32;		// The watch dog timing is 4mS interval
	ET1 = 0 ;	// Disable Timer1 interrupt for TEMP16 PWM control use 

	while ( CONTROL_DATA <= THROTTLE_OFF )		//Wait until stick ON
		{
		Spin_Free ();
		PCA0CPH2 = 0;	// Watch dog timer off. 
		}
//
	Check_Free_Spinning ();
	if ( SPINNING == 1 )
		{
		goto BEMF_SPIN;
		}
// Energize the stepping drive
	//START_DRIVE_STATE = 1;
	Get_Comp_Data ();	// for smooth start after BEMF run
	TEMP2 = STEPPING_ON_DUTY_CHOPPING_COUNT;	
	TEMP16 = START_STEPPING_DUTY_FRAME;
	TEMP0 = STEPPING_ON_DUTY_RATIO;
	//
	while( TEMP2 > STEPPING_MAX_SPEED_CHOPPING_COUNT ) // Spin until Stepping max speed
		{ 
		START_DRIVE_STATE ++;
		if ( START_DRIVE_STATE == 7 )
			{
			START_DRIVE_STATE = 1;
			}
		Step_Drive_Count ();
		//
		if ( CONTROL_DATA > 10 )	// If the stick is between 8-10, then very slow step spins
			{
			TEMP2 --;	// acceleration for starting speed
			if ( TEMP0 >= 10 )	// max 10% starting power duty
				{
				TEMP0 --;	// acceleration with power-up
				}
			}
		//
		if ( CONTROL_DATA < THROTTLE_OFF )	// Stick off?
			{
			Spin_Free ();
			break;
			}
		}
//	
	Spin_Free ();
//
	if ( CONTROL_DATA < THROTTLE_OFF )	// Stick off?
		{
		Spin_Free ();
		goto STEPPING_START;
		}
//-----------------
BEMF_SPIN: // Also run ZERO-Cross spin  
//-----------------
	CKCON &= 0xcc;	//#11001100b	; Timer0,1,2 with 1/12 sys. clock.
	ET1 = 1 ;	// Eanble Timer 1 interrupt PWM power control 
	T1_Op_Flag = 0;
	PWM_FRAME = PWM_FRAME_1kHz; // 1kHz sampling at starting
	ON_DUTY = THROTTLE_OFF+2;
	SAMPLING_COUNT = 0;
	T1_Op_Flag = 0;	// on 
	T1_PWM_OFF_DUTY ();
	Start_T0 ();	// start Timer0 for duty increase delay control
	ON_DUTY = THROTTLE_OFF+2;
	ZERO_CROSS_RUN = 0;
//
	while ( CONTROL_DATA >= THROTTLE_OFF ) // Wait untill throttle stick off
		{
		if ( ZERO_CROSS_RUN == 0 )
			{
			BEMF_Drive ();
			}
		else
			{
			Step_Start ();	// zero cross spin				
			}
		//
		if ( PREV_DRIVE_STATE == DRIVE_STATE )
			{
			SAMPLING_COUNT ++;		
			}
		else
			{
/////////////////////////////////////////////////////////////////
			if ( DRIVE_STATE == 3 ) // Scope trigger
				{
				P2=1; P2=0;
				}
///////////////////////////////////////////////////////////////*/
			STATE_CHANGES = 1;
			SAMPLING_COUNT = 1;
			NUMBER_OF_SAMPLING = 0;
			}
		//
		Set_comparator_input_for_ZC_detect ();
		Power_Up_Timer ();
		//
		if ( ON_DUTY == THROTTLE_OFF + 4 )
			{
			PWM_FRAME = PWM_FRAME_5kHz;
			}
		if ( ON_DUTY >= THROTTLE_OFF + 10 )
			{
			if ( PWM_FRAME > PWM_FRAME_13kHz)
				{
				L1++;	// For Smooth PWM freq change
				if ( L1 > 3 )
					{
					PWM_FRAME --;				
					T1_PWM_ON_DUTY ();
					L1 = 0;
					}
				}
			}
		//
		if ( PWM_FRAME <= PWM_FRAME_8kHz )
			{
			ZERO_CROSS_RUN = 1;
			CPT0CN |= 0x0a;	// 10mV Hysteresis
			}
		if ( PWM_FRAME > PWM_FRAME_8kHz )
			{
			ZERO_CROSS_RUN = 0;	// BEMF_RUN
			CPT0CN &= 0xf0;	// 0mV Hysteresis			
			}
		//
		if ( CONTROL_DATA < THROTTLE_OFF )	// Stick off?
			{
			Spin_Free ();	// for BEMF sensin
			break;
			}
		PCA0CPH2 = 0;	// Watchdog off
		//
	//ON_TIMER ---------------------------------		
		while ( T1_Op_Flag == 1);	// on timer
		if ( ON_DUTY > CHECK_ZC_AT_PWM_ON_DUTY )
			{
			Zero_Cross_Drive ();
			}
		Spin_Free_N ();	// set power off to get BEMF signal with pull-up high site MOSFET
	// Off Timer --------------------------------
		if ( T1_Op_Flag == 0 )
			{
			while ( T1_Op_Flag == 0 );
			}
		//else 	// Already Off time is finished by top speed power setting
		//
		if ( ZERO_CROSS_RUN == 0 )
			{	
			Spin_Free ();	// for BEMF sensing	
			}
		//
		if ( ON_DUTY <= CHECK_ZC_AT_PWM_ON_DUTY )
			{
			Zero_Cross_Drive ();
			}
		//			
		if ( OVER_ZERO_CROSS == 1 & STATE_CHANGES == 1 & SAMPLING_COUNT >= 1 )
			{
			NUMBER_OF_SAMPLING = SAMPLING_COUNT;
			SAMPLING_COUNT = 1;	// timing advance
			STATE_CHANGES = 0;
			}
		//
		PREV_DRIVE_STATE = DRIVE_STATE;
		// Zero Cross state change control with 33% timing advance
		if ( SAMPLING_COUNT >= NUMBER_OF_SAMPLING*1/3 & NUMBER_OF_SAMPLING > 0 )
			{ 
			Set_to_next_drive ();
			}
		}
	goto STEPPING_START;
}
//-----------------------------------------------------------------------------
void Zero_Cross_Drive (void)
{
	switch ( DRIVE_STATE )	// get zero cross point by comparator
		{
		case 1:
		case 2:
		case 3:
			{
			if ( CPT0CN & 0x40 )	// #01000000b Get CPOUT bit to ZERO_CROSS_CHK_DOWN
				{
				//P2=1;
				OVER_ZERO_CROSS = 0;
				}
			else
				{
				//P2=0;
				OVER_ZERO_CROSS = 1;
				}
			}
		break;
		//
		case 4:
		case 5:
		case 6:
			{
			if ( ~CPT0CN & 0x40 )	// #01000000b Get CPOUT bit to ZERO_CROSS_CHK_UP
				{
				//P2=1; // Monitor ONLY
				OVER_ZERO_CROSS = 0;
				}
			else
				{
				//P2=0; // Monitor ONLY
				OVER_ZERO_CROSS = 1;
				}			
			}
		break;
		}
}
//------------------------
void Set_comparator_input_for_ZC_detect (void)	// configure the comparator pin asign
{
	switch ( START_DRIVE_STATE ) // assign comparator input pin 
		{
		case 1:
			{
			CPT0MX = 0x52;	//#01010010b	; CP in-: P1.3(HALFW), CP in+: P0.4(W) with DOWN slope
			}
		break;
		//
		case 2:
			{
			CPT0MX = 0x15;	//#00010101b	; CP in-: P0.3(V), CP in+: P1.2(HALFV)with UP slope
			}
		break;
		//
		case 3:
			{
			CPT0MX = 0x40;	//#01000000b	; CP in-: P1.1(HALFU), P0.0(U) with DOWN slope
			}
		break;
	//
		case 4:
			{
			CPT0MX = 0x52;	//#01010010b	; CP in-: P1.3(HALFW), CP in+: P0.4(W) with UP slope
			}
		break;
	//
		case 5:
			{
			CPT0MX = 0x15;	//#00010101b	; , CP in-: P0.3(V), CP in+: P1.2(HALFV) with DOWN slope
			}
		break;
	//
		case 6:
			{
			CPT0MX = 0x40;	//#01000000b	; CP in-: P1.1(HALFU), CP in+: P0.0(U) with UP slope
			}
		break;
	//
	}
}
//-----------------------------------------------------------------------------
void BEMF_Drive (void)
{
	Get_Comp_Data ();
	Step_Start ();
}
//
void Set_to_next_drive (void)
{
	DRIVE_STATE ++;
	if ( DRIVE_STATE == 7 )
		{
		START_DRIVE_STATE = 1;
		DRIVE_STATE = 1;
		}
	else
		{
		START_DRIVE_STATE = DRIVE_STATE;	
		}
}
//-----------------------------------------------------------------------------
// Checking free spinning before stepping re-start drive
void Check_Free_Spinning (void)
{
	Spin_Free();	// consider the leak courrent while slow spin as DC drift	

	CKCON |= 0x02;	//#00000010
	CKCON &= 0xfe;	//#11111110 // Timer0,1 uses 1/48 sysclock

	CPT0CN |= 0x0f;	//00001111b 20mV hysteresis

	Start_T0 ();
	TEMP3 = 0; 		// spinning state flags	
	//
	//	while ( TF0 == 0)	// CHECK_FREE_SPIN in 128mS
		while ( TH0 < 128 )	// CHECK_FREE_SPIN in 64mS
		{
		Get_Comp_Data ();
		PCA0CPH2 = 0;	// Watchdog off
		switch ( START_DRIVE_STATE )
			{
			case 1:
			TEMP3 |= 0x01;	// #00000001b
			break;
			//
			case 2:
			TEMP3 |= 0x02;	// #00000010b
			break;
			//
			case 3:
			TEMP3 |= 0x04;	// #00000100b
			break;
			//
			case 4:
			TEMP3 |= 0x08;	// #00001000b
			break;
			//
			case 5:
			TEMP3 |= 0x10;	// #00010000b
			break;
			//
			case 6:
			TEMP3 |= 0x20;	// #00100000b
			break;
			}
		}
//CHECK_ALL_SPIN_PATTERN:
	if ( TEMP3 == 0x3f ) // #00111111b	; spin with all pattern?
		{
		SPINNING = 1;
		}
	else
		{
		SPINNING = 0;
		}			

	CKCON &= 0xfc;	//#11111100 // Timer0,1 uses 1/12 sysclock
	CPT0CN &= 0xf0;	// 0mV hysteresis
}
//---------
void Get_Comp_Data (void)
{	
	L2 = 0;		// never "0" or "7" while getting the comparator data
	START_DRIVE_STATE = 7;	// never "0" or "7" while getting the comparator data

