paulfantom/BLDC-ESC/inspiration/c8051f330/f330_100a_bl_esc_step_5p.c
	while (START_DRIVE_STATE != L2) // Wait untill stable comparator output data
	{
	Comp_Measure ();
	L2 = START_DRIVE_STATE;	
	Comp_Measure ();	// RE_CHECK the comparator result data
	}
}
//
void Comp_Measure (void)	// P0.2 and P0.3(V), P0.4 and P0.5(W) are connected togather by solder.
{
//COMP_A1:
	CPT0MX = 0x20;	//#00100000b	; CP in-: P0.5(W), CP in+: P0.0(U)
	Wait_1250nS (1);
	TEMP0 = CPT0CN & 0x40;	//#01000000b	; Get CPOUT bit

//COMP_B1:
	CPT0MX = 0x10;	//#00010000b	; CP in-: P0.3(V), CP in+: P0.0(U) 
	Wait_1250nS (1);
	TEMP1 = CPT0CN & 0x40;	//#01000000b	; Get CPOUT bit

//COMP_C1:
	CPT0MX = 0x21; 	//#00100001b	; CP in-: P0.5(W), CP in+: P0.2(V)
	Wait_1250nS (1);
	TEMP2 = CPT0CN & 0x40;	//#01000000b	; Get CPOUT bit

//COMP_LOGIC://UW	
	if (TEMP0 == 0)	// CP in+:(U), CP in-:(W):
	{//	jmp WV		; W>U
		if (TEMP2 == 0)	// WV:
		{//	jmp WH_UV		; W>V 
			if (TEMP1 == 0) //WH_UV
			{//	jmp WH_VM_UL	; V>U, #5 or All"0" offset check with connection V on the +input
			START_DRIVE_STATE = 5; //Inductive Kick is #2
			}
			else
			{//	jnz WH_UM_VL	; U>V, #6
			START_DRIVE_STATE = 6;	// Inductive Kick is #3
			}
		}
		else
		{START_DRIVE_STATE = 4;	// Inductive Kick is #1
		}
	}
	else
	{//	jnz UV		; U>W
		if (TEMP1 == 0) // UV
		{//	jmp VH_UM_WL	; V>U, #3	
		START_DRIVE_STATE = 3;	// Inductive Kick is #6
		}
		else
		{//	jnz UH_VW		; U>V	
			if (TEMP2 == 0) // UH_VW
			{//	jmp UH_WM_VL	; W>V, #1
			START_DRIVE_STATE = 1;	// Inductive Kick is #4
			}
			else
			{//	jnz UH_VM_WL	; V>W, #2 or All"1" offset check with connection V on the +input
			START_DRIVE_STATE = 2;	// V>W, #2 or All"1" offset check with connection V on the +input. Inductive Kick is #5
			}		
		}
	}
}
//-----------------------------------------------------------------------------
// Timing Controls
//-----------------------------------------------------------------------------
void Wait_1250nS (COUNTS)
{
	for (DELAY_COUNTS = 1; DELAY_COUNTS <= COUNTS; DELAY_COUNTS++)
		{	// 1 time loop delay is 1.25uS include call function
		}
}
//
void Start_T0 (void)	// no re-load function in. And can NOT use TMR0 sfr
// Timer0 16bit counter with pre-scaled clock is 24.5MHz/12=490nS.
{
	TR0 = 0;		// Stop T0
	TL0 = 0;		// Clear T0
	TH0 = 0;
	TF0 = 0;		// Clear over flow flag
	TR0 = 1;		// Start T0
}
//
void T1_PWM_OFF_DUTY (void)	// no re-load function in T1
//; Timer1 16bit counter with pre-scaled clock is 24.5MHz/12=490nS.
{
	TR1 = 0;		// Stop T1
	TEMP16S = ~(PWM_FRAME - ~TEMP16);	// set T1
	TL1 = TEMP16S & 0x00ff;
	TH1 = TEMP16S / 256;
	TF1 = 0;		// Clear over flow flag
	TR1 = 1;		// Start T1
}
void T1_PWM_ON_DUTY (void)	// no re-load function in T1
//; Timer1 16bit counter with pre-scaled clock is 24.5MHz/12=490nS.
{
	TR1 = 0;		// Stop T1
	if ( ON_DUTY <= STICK_RESOLUTION )
		{
		TEMP16 = ~(PWM_FRAME*ON_DUTY/STICK_RESOLUTION);	// set T1
		}
	TL1 = TEMP16 & 0x00ff;
	TH1 = TEMP16 / 256;	//& 0xff00;
	TF1 = 0;		// Clear over flow flag
	TR1 = 1;		// Start T1
}
//
/*
void Start_T2 (void)	// zero cross detect timer
{
	TR2 = 0;	// Stop T2
	TMR2RL = 0xffff;	// re-load data
	TMR2 = 0;	// Clear T2 
	TF2H = 0;	// High byte flag off
	TF2L = 0;	// Low byte flag off
	TR2 = 1;	//Start T2
}

void Start_T3 (void)	//
{
	TMR3CN &= 0x08;	// 00001000b.  Stop T3 and clear all flags with 16 bit operation 
	TMR3RL = 0xffff;	// re-load data
	TMR3 = 0;	// Clear T3 
	TMR3CN |= 0x04;	// 00000100b Start T3
}
*/
//;-----------------------
void Power_Up_Timer (void)
{
	if ( TH0 > BEMF_DUTY_INC_TIMING )	// get slow responce control for stability by T0
		{
		Start_T0 ();	// re-start Timer0
		//
		if ( CONTROL_DATA > ON_DUTY )	// DUTY > Rx input pulse?	
			{
			ON_DUTY ++;	// increase ON_DUTY
			}
		}
	//
	if ( CONTROL_DATA < ON_DUTY )
		{
		if ( ON_DUTY > THROTTLE_OFF)
			{
			ON_DUTY --;	// decrease ON_DUTY
			}
		}
}
//;-----------------------
void Step_Drive_Count (void)
{
	for ( L2=1; L2 < TEMP2; L2++ ) // TEMP2 is STEPPING_ON_DUTY_CHOPPING_COUNTER
		{
		Step_Start ();
		Stepping_Drive_On_Timer ();	//STEPPING On timer
		Stepping_Off_Timer ();
		}
}
//;------
void Step_Start (void)
{
		switch (START_DRIVE_STATE) 
		{
		case 1:
			State1_On ();	//U=1, V=0, W=3ST
		break;

		case 2:
			State2_On ();	// U=1, V=3ST, W=0	
		break;

		case 3:
			State3_On ();	// U=3ST, V=1, W=0
		break;

		case 4:
			State4_On ();	// U=3ST, V=1, W=0
		break;

		case 5:
			State5_On ();	// W=1
		break;

		case 6:
			State6_On ();	// W=1
		break;
		}
}
//
//Stepping_Drive_On_Timer:
void Stepping_Drive_On_Timer (void)
{
	TMR3CN &= 0x3b;	//anl TMR3CN, #00111011b	; clr TF3H, clr TF3L and clr TR3
	STEPPING_ON_DUTY = TEMP16/TEMP0;
//CALC_STEPPING_OFF_DUTY_TIME:
	TMR3RL = ~(START_STEPPING_DUTY_FRAME - STEPPING_ON_DUTY);

//CALC_STEPPING_ON_DUTY_TIME:
	TMR3 = ~STEPPING_ON_DUTY;

	TMR3CN |= 0x04; 	// orl TMR3CN, #00000100b	; setb TR3 to start T3

//SAMPLE_ON_Loop:
	while (~TMR3CN & 0x80)	// get bit7 as TF3H T3 High byte over Flow
	{
	PCA0CPH2 = 0;
	}	// Watchdog off} 

	TMR3CN &= 0x3f;	// anl #00111111b	; clr TF3H, TF3L 
}
//------------			
void Stepping_Off_Timer (void)
{	
	Braking ();
	//Spin_Free();
	while (~TMR3CN & 0x80);	// get TF3H T3 High byte over Flow
//	Get_Start_Drive_State ();
	TMR3CN &= 0x3f;	// anl #00111111b	; clr TF3H, TF3L 
	PCA0CPH2 = 0; 	// Watchdog off
}
//
// Sound Generator
void ON_Sound (void)
{
for (L1=1 ; L1<= 3;L1++)	// 3 times sound
	{
	for (L2=1; L2<TEMP2; L2++)
		{
		PCA0CPH2 = 0;	// watch dog reset
		State1_On();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		//
		State4_On ();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		//
		State3_On ();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		//
		State6_On ();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		//
		State5_On ();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		//
		State2_On ();  
		Wait_1250nS (TEMP0);	// On duty Timer
		Spin_Free ();
		Wait_1250nS (TEMP1);	// Off duty Timer
		}
//
	for (L2=1; L2<=50;L2++)
		{
		PCA0CPH2 = 0;	// watch dog reset
		Wait_1250nS (2000);	// 2.5 S Timer
		}
	}
}
//--------------------------------------
// Motor drive each state control 
//--------------------------------------
void State1_On (void)	
{
	Spin_Free (); // All MOSFTEs off
	P0 |= 0x40;	//mov P0, #01000000 	; UH(P0.6)="H"
	P1 = 0x2e;	//mov P1, #00101110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="H", WH(P1.6)="L", WL(P1.7) ="L"
	DRIVE_STATE = 1; //
}
//
void State2_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 |= 0x40;	//mov P0, #01000000 	; UH(P0.6)="H"	
	P1 = 0x8e;	//mov P1, #10001110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="H"	
	DRIVE_STATE = 2; 
}
//
void State3_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 &= 0xbf;	// #101111111b	; UH(P0.6)="L"
	P1 = 0x9e;	//mov P1, #10011110b	; UL(P1.0)="L", VH(P1.4)="H", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="H"	
	DRIVE_STATE = 3; 
}
//	
void State4_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 &= 0xbf;	// UH(P0.6)="L"	
	P1 = 0x1f;	// mov P1, #00011111b	; UL(P1.0)="H", VH(P1.4)="H", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="L"	
	DRIVE_STATE = 4; 
}
//
void State5_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 &= 0xbf;	//clr P0.6		; UH(P0.6)="L"	
//	P1 = 0x4f;	//mov P1, #01001111b	; UL(P1.0)="H", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="H", WL(P1.7) ="L"
	P1 = 0x4f;	//mov P1, #01001111b	; UL(P1.0)="H", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="H", WL(P1.7) ="L"
	DRIVE_STATE = 5; 
}
//
void State6_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 &= 0xbf;	// clr P0.6		; UH(P0.6)="L"	
	P1 = 0x6e;	// mov P1, #01101110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="H", WH(P1.6)="H", WL(P1.7) ="L"
	DRIVE_STATE = 6; 
}
//
void Spin_Free (void) // All output MOSFETs off
{
	P0 &= 0xbf;	// clr P0.6
	P1 &= 0x0e;	// anl P1, #00001110b	; UL(P1.0), VH(P1.4), VL(P1.5), WH(P1.6), WL(P1.7) ="L"	
	Wait_1250nS(1);	// MOSFETs off time
}
//
void Spin_Free_N (void) //
{
	switch ( DRIVE_STATE )
	{
/*	Spin_Free (); // All MOSFTEs off
	P0 |= 0x40;	//mov P0, #01000000 	; UH(P0.6)="H"
	P1 = 0x2e;	//mov P1, #00101110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="H", WH(P1.6)="L", WL(P1.7) ="L"
	DRIVE_STATE = 1; //
}
//
void State2_On (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 |= 0x40;	//mov P0, #01000000 	; UH(P0.6)="H"	
	P1 = 0x8e;	//mov P1, #10001110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="H"	
	DRIVE_STATE = 2; 
}
*/
		case 1:
		case 2:
		P0 |= 0x40;	// #01000000 	; //UH
		P1 &= 0x0e;	// #00001110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="L"
		break;

		case 3:
		case 4:
		P0 &= 0xbf;	// VH	
		P1 &= 0x1e;	// mov P1, #00011110b	; UL(P1.0)="L", VH(P1.4)="H", VL(P1.5)="L", WH(P1.6)="L", WL(P1.7) ="L"	
		break;

		case 5:
		case 6:

