paulfantom/BLDC-ESC/inspiration/c8051f330/f330_100a_bl_esc_step_5p.c
		P0 &= 0xbf;	// WH	
		P1 &= 0x4e;	// #01001110b	; UL(P1.0)="L", VH(P1.4)="L", VL(P1.5)="L", WH(P1.6)="H", WL(P1.7) ="L"
		break;
	}
}

//
void Braking (void)	
{				
	Spin_Free (); // All MOSFTEs off
	P0 &= 0xbf;	// clr P0.6		; UH(P0.6)="L"	
	P1 = 0xaf;	//mov P1, #10101111b	; UL(P1.0)="H", VH(P1.4)="L", VL(P1.5)="H", WH(P1.6)="L", WL(P1.7) ="H"	
}

//-----------------------------------------------------------------------------
// Interrupt Service Routines to get Rx input pulse width
//-----------------------------------------------------------------------------
void PCA_ISR (void) interrupt 11
{
	CCF0 = 0;	// clear PCA0 module0 interrupt flag

//Capture_Edge_check:
	if ((PCA0CPM0 & 0x20) == 0)
		{	// fall edge
		PCA0CPM0 = 0x21;	// #00100001b
							// Next PCA0 will be captured by positive edge on P0.6 first and generates the interrupt.
		PULSE_WIDTH = PCA0CPH0<<8;	// set to high byte
		PULSE_WIDTH += PCA0CPL0; // set to 16bit data 

		PCA0_CAP = PCA0_CAP_H<<8;
		PCA0_CAP += PCA0_CAP_L;

		PULSE_WIDTH -= PCA0_CAP;
		PULSE_WIDTH -= CTRL_MIN;

		if ( PULSE_WIDTH < 0 )
			{
			CONTROL_DATA = 0;			
			PULSE_WIDTH = 0;
			}
		//
 		if (PULSE_WIDTH > 2450) // over 2.2mS? as check max. pulse width.
			{
			// keep previous control data as noise
			}	
		else 
			{
			if ( CONTROL_DATA_0 == PULSE_WIDTH/16 )
				{
				CONTROL_DATA = CONTROL_DATA_0;	// W-check OK.				
				}
			else
				{
				CONTROL_DATA_0 = PULSE_WIDTH/16; // re-check as W-check
				}
			//
			if ( CONTROL_DATA < THROTTLE_OFF ) //  min. pulse width check. The resolution is 490uS.
				{
				CONTROL_DATA = 1;	//ALMOST_ZERO
				PROPO_PULSE_IN_COUNTER ++;
				}
			else // Normal pulse
				{          	
				if ( CONTROL_DATA >= CONTROL_DATA_MAX )
					{
					CONTROL_DATA = CONTROL_DATA_MAX; // max power limiter
					}
				}
			}
		}
	//
	else 
		{	// Rise edge
   		PCA0_CAP_L = PCA0CPL0;	// Get front edge time
		PCA0_CAP_H = PCA0CPH0;
		PCA0CPM0 = 0x11;	//#00010001b	; PCA0 wll be captured by negative edge on P0.6 first and generates the interrupt.
		}
}
//-----------------------------------------------------------------------------
void T1_ISR (void) interrupt 3	// T1 interrupt
{
	TF1 = 0;	// clear int flag.
	if ( T1_Op_Flag == 1 )
		{
		T1_PWM_OFF_DUTY (); // Timer-1 PWM zero cross control
		T1_Op_Flag = 0;
		//P2 = 0;  // Monitor ONLY
		}
	//
	else
		{
		T1_PWM_ON_DUTY ();
		T1_Op_Flag = 1;
		//P2 = 1; // Monitor ONLY
		}	
}	 
//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------